class BotHelpMessage
def self.help
"
===============================================================================================================
/similar <(+ or -)query>/  -<query>の類語を表示します 語頭に+||-が必要です
===============================================================================================================
/out_today/           -きょうでる漫画
/cinit/               -あなたのIDでDBを新規作成
/cadd <title>/     -あなたのDBに<title>を追加
/cremove <title>/  -あなたのDBから<title>を削除（完全一致）
/cremove all/         -あなたのDBをきれいに削除
/cshow/               -DBの中身を表示します
/titles/              -DBの中にきょうでるのがあれば叫びます（とりつくろい機能）
================================================================================================================
/summary <boss>/    -<boss>の情報を表示(部分一致OK、イベント、ナイトメア、マルチに対応。ダンジョン名でもいけそう)
/eqp ff<number> <equipment>/   -FF<number>の装備一覧を対象に、<eqpuipment>の情報を表示します。
                               （equipmentは部分一致OK。照会対象は★5,6のみ。）
                               （numberは半角数字あるいはローマ数字でも）
/eqp acc(或はaccy) <equipment(名前、或は軽減属性、状態異常等)>/  -<equipment>にマッチしたアクセサリを表示。
                                部分一致OK。複数クエリ不可。レアリティは全アクセサリを照会。
================================================================================================================
"
end
end
