
class Albhed_Mog
  JtoA_DICTIONARY ={
"あ"=>"ワ","い"=>"ミ","う"=>"フ","え"=>"ネ","お"=>"ト",
"か"=>"ア","き"=>"チ","く"=>"ル","け"=>"テ","こ"=>"ヨ",
"さ"=>"ラ","し"=>"キ","す"=>"ヌ","せ"=>"ヘ","そ"=>"ホ",
"た"=>"サ","ち"=>"ヒ","つ"=>"ユ","て"=>"セ","と"=>"ソ",
"な"=>"ハ","に"=>"シ","ぬ"=>"ス","ね"=>"メ","の"=>"オ",
"は"=>"マ","ひ"=>"リ","ふ"=>"ク","へ"=>"ケ","ほ"=>"ロ",
"ま"=>"ヤ","み"=>"イ","む"=>"ツ","め"=>"レ","も"=>"コ",
"や"=>"タ","ゆ"=>"ヲ","よ"=>"モ",
"ら"=>"ナ","り"=>"ニ","る"=>"ウ","れ"=>"エ","ろ"=>"ノ",
"わ"=>"カ","を"=>"ム","ん"=>"ン",
"が"=>"ダ","ぎ"=>"ジ","ぐ"=>"ヅ","げ"=>"デ","ご"=>"ゾ",
"ざ"=>"バ","じ"=>"ギ","ず"=>"ブ","ぜ"=>"ゲ","ぞ"=>"ボ",
"だ"=>"ガ","ぢ"=>"ビ","づ"=>"グ","で"=>"ベ","ど"=>"ゴ",
"ば"=>"ザ","び"=>"ヂ","ぶ"=>"ズ","べ"=>"ゼ","ぼ"=>"ド",
"ぱ"=>"プ","ぴ"=>"ペ","ぷ"=>"パ","ぺ"=>"ポ","ぽ"=>"ピ",
"ゃ"=>"ャ","ゅ"=>"ュ","ょ"=>"ョ","ゎ"=>"ヮ","っ"=>"ッ",
}


AtoJ_DICTIONARY ={
"ワ"=>"あ","ミ"=>"い","フ"=>"う","ネ"=>"え","ト"=>"お",
"ア"=>"か","チ"=>"き","ル"=>"く","テ"=>"け","ヨ"=>"こ",
"ラ"=>"さ","キ"=>"し","ヌ"=>"す","ヘ"=>"せ","ホ"=>"そ",
"サ"=>"た","ヒ"=>"ち","ユ"=>"つ","セ"=>"て","ソ"=>"と",
"ハ"=>"な","シ"=>"に","ス"=>"ぬ","メ"=>"ね","オ"=>"の",
"マ"=>"は","リ"=>"ひ","ク"=>"ふ","ケ"=>"へ","ロ"=>"ほ",
"ヤ"=>"ま","イ"=>"み","ツ"=>"む","レ"=>"め","コ"=>"も",
"タ"=>"や","ヲ"=>"ゆ","モ"=>"よ",
"ナ"=>"ら","ニ"=>"り","ウ"=>"る","エ"=>"れ","ノ"=>"ろ",
"カ"=>"わ","ム"=>"を","ン"=>"ん",
"ダ"=>"が","ジ"=>"ぎ","ヅ"=>"ぐ","デ"=>"げ","ゾ"=>"ご",
"バ"=>"ざ","ギ"=>"じ","ブ"=>"ず","ゲ"=>"ぜ","ボ"=>"ぞ",
"ガ"=>"だ","ビ"=>"ぢ","グ"=>"づ","ベ"=>"で","ゴ"=>"ど",
"ザ"=>"ば","ヂ"=>"び","ズ"=>"ぶ","ゼ"=>"べ","ド"=>"ぼ",
"プ"=>"ぱ","ペ"=>"ぴ","パ"=>"ぷ","ポ"=>"ぺ","ピ"=>"ぽ",
"ャ"=>"ゃ","ュ"=>"ゅ","ョ"=>"ょ","ヮ"=>"ゎ","ッ"=>"っ",
}

  def self.mog_translate(sentence,a_or_j)
      translated = []

    case a_or_j
    when :a
      sentence.chars do |ch|
      if JtoA_DICTIONARY.has_key?(ch)
        JtoA_DICTIONARY.each do |j,a|
          if ch == j
            translated << a
          end
        end
      else
        translated << ch
        end
     end

   when :j
     replaced_sentence = sentence.gsub("クポ","置換用置換")
     replaced_sentence.chars do |ch|
     if AtoJ_DICTIONARY.has_key?(ch)
       AtoJ_DICTIONARY.each do |a,j|
         if ch == a
           translated << j
         end
       end
     else
       translated << ch
     end #do
     end #if

    end #when
       pre_translated = translated.join.encode("utf-8")
      return "#{sentence} -> #{pre_translated.gsub("置換用置換","クポ")}"
  end #def

end#Albhed class
